In [1]:
import pandas as pd

In [9]:
td = pd.read_csv('titanic-data.csv')

In [10]:
td_original = td.copy()

In [22]:
td = td_original.copy()

In [23]:
td.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB

In [24]:
td.Survived = td.Survived.replace(1, 'True')

In [25]:
td.Survived = td.Survived.replace(0, 'False')

In [26]:
td.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,False,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,True,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,True,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,True,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,False,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [33]:
td.Embarked = td.Embarked.replace('S', 'Southampton')
td.Embarked = td.Embarked.replace('C', 'Cherbourg')
td.Embarked = td.Embarked.replace('Q', 'Queenstown')

In [35]:
td.Embarked.sample(10)

234    Southampton
761    Southampton
757    Southampton
274     Queenstown
575    Southampton
683    Southampton
647      Cherbourg
698      Cherbourg
214     Queenstown
376    Southampton
Name: Embarked, dtype: object

In [36]:
td.to_csv('titanic_clean.csv')